---
kind: method
id: M:Autodesk.Revit.DB.Events.DocumentPrintingEventArgs.GetViewElementIds
source: html/32d6fdf7-3bd7-41b8-d0e7-1b5c5e5b442c.htm
---
# Autodesk.Revit.DB.Events.DocumentPrintingEventArgs.GetViewElementIds Method

Returns ElementIds of the views to be printed.

## Syntax (C#)
```csharp
public IList<ElementId> GetViewElementIds()
```

## Returns
ElementIds of the views to be printed.